In [1]:
import pandas as pd

In [2]:
staff = {'names':['ben', 'lily', 'rice', 'bob'],
         'age' : [12, 56, 23, 79],
         'gender':['M', 'F','M','M'],
         'salary': [4500.2, 1000.6, 5000.26, 7700.0]
        }

In [3]:
pd.DataFrame(staff)

  names  age gender   salary
0   ben   12      M  4500.20
1  lily   56      F  1000.60
2  rice   23      M  5000.26
3   bob   79      M  7700.00

In [4]:
db = pd.DataFrame(staff)   # its quite crucial to store

In [5]:
db

  names  age gender   salary
0   ben   12      M  4500.20
1  lily   56      F  1000.60
2  rice   23      M  5000.26
3   bob   79      M  7700.00

# Pandas series

In [6]:
# a series is one column/field of data
# a series is single column of data
# a series can only be accessed via its index number
# a series has no column header
# a series always reports its data type

# you remove series from a data frame
# when you import data, you're importing a data frame
# a data frame has column headers

In [7]:
x = [1,3,7,9,49]
y = ['ben', 'ace', 'jack', 'bob']
z = [True, False, True,False]

In [8]:
pd.Series(x)

0     1
1     3
2     7
3     9
4    49
dtype: int64

In [9]:
pd.Series(y)

0     ben
1     ace
2    jack
3     bob
dtype: object

In [10]:
pd.Series(z)

0     True
1    False
2     True
3    False
dtype: bool

In [11]:
aj = pd.Series(x)
cj = pd.Series(y)
dj = pd.Series(z)

## accessing the elements in a Series

In [12]:
aj

0     1
1     3
2     7
3     9
4    49
dtype: int64

In [13]:
dj

0     True
1    False
2     True
3    False
dtype: bool

In [14]:
aj.loc[2]

7

In [15]:
aj.loc[2:4]

2     7
3     9
4    49
dtype: int64

In [16]:
aj.loc[3:]

3     9
4    49
dtype: int64

In [17]:
aj.loc[[4,2]]   #locate only 4 and 2     the loc syntax is .loc[]

4    49
2     7
dtype: int64

In [18]:
cj.loc[3]

'bob'

In [19]:
cj.loc[3].upper()

'BOB'

In [20]:
aj

0     1
1     3
2     7
3     9
4    49
dtype: int64

In [21]:
cj

0     ben
1     ace
2    jack
3     bob
dtype: object

In [22]:
aj.sum()
aj.mean()

13.8

In [23]:
cj.str.replace('e','#')      #when the data type of a series is an object/string, you have to use the .str to enable some fxns. But .count() is an exception

0     b#n
1     ac#
2    jack
3     bob
dtype: object

In [24]:
cj.count()

4

In [25]:
cj.value_counts()

ben     1
ace     1
jack    1
bob     1
dtype: int64

In [26]:
cj.loc[0] = 'Musa'

In [27]:
cj

0    Musa
1     ace
2    jack
3     bob
dtype: object

# Data Frame

In [28]:
# a dataframe is a minimum of 2 columns
# a dataframe can be accessed via its column name or index number
# once a single column is sliced out from a dataframe, it becomes a series

In [29]:
db

  names  age gender   salary
0   ben   12      M  4500.20
1  lily   56      F  1000.60
2  rice   23      M  5000.26
3   bob   79      M  7700.00

In [30]:
db.loc[3]    # slicing from the row

names        bob
age           79
gender         M
salary    7700.0
Name: 3, dtype: object

In [31]:
db['age']   # slicing out one column

0    12
1    56
2    23
3    79
Name: age, dtype: int64

In [32]:
db[['age','gender']]  #slicing out 2 columns. The result gives you a data frame

   age gender
0   12      M
1   56      F
2   23      M
3   79      M

### slicing out column(s)

In [33]:
db['salary']   #slicing out 1 column

0    4500.20
1    1000.60
2    5000.26
3    7700.00
Name: salary, dtype: float64

In [34]:
db['salary'].max()

7700.0

In [35]:
db['salary'].mean()

4550.265

In [36]:
db[['age', 'gender']]    #slicing out 2 or more columns. you'll put the columns in a list using []

   age gender
0   12      M
1   56      F
2   23      M
3   79      M

### slicing out row(s)

In [37]:
db

  names  age gender   salary
0   ben   12      M  4500.20
1  lily   56      F  1000.60
2  rice   23      M  5000.26
3   bob   79      M  7700.00

In [38]:
db.loc[[3,1]]

  names  age gender  salary
3   bob   79      M  7700.0
1  lily   56      F  1000.6

In [39]:
db.loc[0]

names        ben
age           12
gender         M
salary    4500.2
Name: 0, dtype: object

In [40]:
db

  names  age gender   salary
0   ben   12      M  4500.20
1  lily   56      F  1000.60
2  rice   23      M  5000.26
3   bob   79      M  7700.00

# Some question and answers (stynax) in the Python Exam worth taking note of

In [42]:
db.loc[:]

  names  age gender   salary
0   ben   12      M  4500.20
1  lily   56      F  1000.60
2  rice   23      M  5000.26
3   bob   79      M  7700.00

In [41]:
print(db.loc[:])

  names  age gender   salary
0   ben   12      M  4500.20
1  lily   56      F  1000.60
2  rice   23      M  5000.26
3   bob   79      M  7700.00

In [44]:
len(db)

4

In [45]:
l = [3,5,25,1,3]

In [46]:
min(l)

1

In [47]:
db

  names  age gender   salary
0   ben   12      M  4500.20
1  lily   56      F  1000.60
2  rice   23      M  5000.26
3   bob   79      M  7700.00

In [49]:
db.transpose()

             0       1        2       3
names      ben    lily     rice     bob
age         12      56       23      79
gender       M       F        M       M
salary  4500.2  1000.6  5000.26  7700.0

In [50]:
Example = 'Hello'

In [51]:
Example.count('l')

2

In [52]:
db[:]

  names  age gender   salary
0   ben   12      M  4500.20
1  lily   56      F  1000.60
2  rice   23      M  5000.26
3   bob   79      M  7700.00

In [55]:
db[:] = 0;

In [56]:
db

   names  age  gender  salary
0      0    0       0       0
1      0    0       0       0
2      0    0       0       0
3      0    0       0       0

In [58]:
db.describe()

       names  age  gender  salary
count    4.0  4.0     4.0     4.0
mean     0.0  0.0     0.0     0.0
std      0.0  0.0     0.0     0.0
min      0.0  0.0     0.0     0.0
25%      0.0  0.0     0.0     0.0
50%      0.0  0.0     0.0     0.0
75%      0.0  0.0     0.0     0.0
max      0.0  0.0     0.0     0.0

In [62]:
db.head(1)

   names  age  gender  salary
0      0    0       0       0

In [63]:
db.tail(2)

   names  age  gender  salary
2      0    0       0       0
3      0    0       0       0

In [61]:
db.loc[[0,1]]

   names  age  gender  salary
0      0    0       0       0
1      0    0       0       0

In [64]:
staff = {'names':['ben', 'lily', 'rice', 'bob'],
         'age' : [12, 56, 23, 79],
         'gender':['M', 'F','M','M'],
         'salary': [4500.2, 1000.6, 5000.26, 7700.0]
        }

In [65]:
df = pd.DataFrame(staff)

In [66]:
df

  names  age gender   salary
0   ben   12      M  4500.20
1  lily   56      F  1000.60
2  rice   23      M  5000.26
3   bob   79      M  7700.00

In [70]:
df.sort_values

<bound method DataFrame.sort_values of   names  age gender   salary
0   ben   12      M  4500.20
1  lily   56      F  1000.60
2  rice   23      M  5000.26
3   bob   79      M  7700.00>

In [71]:
### df.columns, df.index, df.dtypes, df.shape, df.sort_values ...are the 5 main ones you do not put ()